# Ungroup

## Description
Procedure Ungroup ungroups selected objects in a VectorWorks document.When Ungroup is called, any selected group objects will be destroyed, reverting to the original component objects.

```pascal
PROCEDURE Ungroup;
```

```python
def vs.Ungroup():
    return None
```

## Version
Availability: from All Versions

## Category
* Objects - Groups